; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-4-14)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-1 - location
	p1-5 - location
	p1-7 - location
	p2-0 - location
	p2-1 - location
	p2-3 - location
	p2-6 - location
	p3-7 - location
	p3-8 - location
	p4-2 - location
	p4-6 - location
	p5-2 - location
	p5-4 - location
	p7-0 - location
	p8-1 - location
	p8-7 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s7)
	(at driver3 s0)
	(at truck1 s5)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s7)
	(empty truck3)
	(at truck4 s8)
	(empty truck4)
	(at package1 s8)
	(at package2 s7)
	(at package3 s6)
	(at package4 s2)
	(at package5 s8)
	(at package6 s0)
	(at package7 s8)
	(at package8 s0)
	(at package9 s5)
	(at package10 s0)
	(at package11 s5)
	(at package12 s5)
	(at package13 s2)
	(at package14 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 2)
	(= (time-to-walk p0-1 s0) 2)
	(= (time-to-walk s1 p0-1) 4)
	(= (time-to-walk p0-1 s1) 4)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 76)
	(= (time-to-walk p1-5 s1) 76)
	(= (time-to-walk s5 p1-5) 45)
	(= (time-to-walk p1-5 s5) 45)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(= (time-to-walk s1 p1-7) 10)
	(= (time-to-walk p1-7 s1) 10)
	(= (time-to-walk s7 p1-7) 69)
	(= (time-to-walk p1-7 s7) 69)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 9)
	(= (time-to-walk p2-0 s2) 9)
	(= (time-to-walk s0 p2-0) 5)
	(= (time-to-walk p2-0 s0) 5)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 22)
	(= (time-to-walk p2-1 s2) 22)
	(= (time-to-walk s1 p2-1) 58)
	(= (time-to-walk p2-1 s1) 58)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 9)
	(= (time-to-walk p2-3 s2) 9)
	(= (time-to-walk s3 p2-3) 87)
	(= (time-to-walk p2-3 s3) 87)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 37)
	(= (time-to-walk p2-6 s2) 37)
	(= (time-to-walk s6 p2-6) 68)
	(= (time-to-walk p2-6 s6) 68)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(= (time-to-walk s3 p3-7) 32)
	(= (time-to-walk p3-7 s3) 32)
	(= (time-to-walk s7 p3-7) 99)
	(= (time-to-walk p3-7 s7) 99)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(= (time-to-walk s3 p3-8) 73)
	(= (time-to-walk p3-8 s3) 73)
	(= (time-to-walk s8 p3-8) 75)
	(= (time-to-walk p3-8 s8) 75)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 25)
	(= (time-to-walk p4-2 s4) 25)
	(= (time-to-walk s2 p4-2) 36)
	(= (time-to-walk p4-2 s2) 36)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 9)
	(= (time-to-walk p4-6 s4) 9)
	(= (time-to-walk s6 p4-6) 54)
	(= (time-to-walk p4-6 s6) 54)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 94)
	(= (time-to-walk p5-2 s5) 94)
	(= (time-to-walk s2 p5-2) 29)
	(= (time-to-walk p5-2 s2) 29)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 43)
	(= (time-to-walk p5-4 s5) 43)
	(= (time-to-walk s4 p5-4) 27)
	(= (time-to-walk p5-4 s4) 27)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(= (time-to-walk s7 p7-0) 16)
	(= (time-to-walk p7-0 s7) 16)
	(= (time-to-walk s0 p7-0) 30)
	(= (time-to-walk p7-0 s0) 30)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(= (time-to-walk s8 p8-1) 57)
	(= (time-to-walk p8-1 s8) 57)
	(= (time-to-walk s1 p8-1) 27)
	(= (time-to-walk p8-1 s1) 27)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(= (time-to-walk s8 p8-7) 22)
	(= (time-to-walk p8-7 s8) 22)
	(= (time-to-walk s7 p8-7) 59)
	(= (time-to-walk p8-7 s7) 59)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 31)
	(= (time-to-drive s1 s0) 31)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 97)
	(= (time-to-drive s2 s0) 97)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 3)
	(= (time-to-drive s3 s0) 3)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 41)
	(= (time-to-drive s4 s0) 41)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 65)
	(= (time-to-drive s5 s0) 65)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 12)
	(= (time-to-drive s7 s0) 12)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 45)
	(= (time-to-drive s3 s1) 45)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 86)
	(= (time-to-drive s4 s1) 86)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 69)
	(= (time-to-drive s7 s1) 69)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 54)
	(= (time-to-drive s1 s2) 54)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 73)
	(= (time-to-drive s6 s2) 73)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 6)
	(= (time-to-drive s2 s4) 6)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 22)
	(= (time-to-drive s3 s4) 22)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 5)
	(= (time-to-drive s5 s4) 5)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 4)
	(= (time-to-drive s1 s5) 4)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 94)
	(= (time-to-drive s7 s5) 94)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 80)
	(= (time-to-drive s4 s6) 80)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 28)
	(= (time-to-drive s8 s6) 28)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 29)
	(= (time-to-drive s3 s7) 29)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 89)
	(= (time-to-drive s4 s7) 89)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 82)
	(= (time-to-drive s2 s8) 82)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 23)
	(= (time-to-drive s3 s8) 23)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s6)
	(at driver3 s2)
	(at truck2 s2)
	(at truck3 s7)
	(at truck4 s5)
	(at package1 s0)
	(at package2 s5)
	(at package3 s8)
	(at package4 s0)
	(at package5 s7)
	(at package6 s8)
	(at package7 s4)
	(at package8 s5)
	(at package9 s4)
	(at package10 s3)
	(at package11 s3)
	(at package12 s1)
	(at package13 s7)
	(at package14 s1)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 1  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver2 truck3 s7)
   deleted: (at driver2 s7) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 19
2. (drive-truck truck3 s7 s3 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s3)
   changed: (driven) from 0 to 29
   goals met: 0 of 19
3. (walk driver3 s0 p2-0)
   deleted: (at driver3 s0)
   added: (at driver3 p2-0)
   changed: (walked) from 0 to 5
   goals met: 0 of 19
4. (walk driver3 p2-0 s2)
   deleted: (at driver3 p2-0)
   added: (at driver3 s2)
   changed: (walked) from 5 to 14
   goals met: 1 of 19
5. (drive-truck truck3 s3 s4 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (driven) from 29 to 51
   goals met: 1 of 19
6. (drive-truck truck3 s4 s2 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (driven) from 51 to 57
   goals met: 1 of 19
7. (load-truck package4 truck3 s2)
   deleted: (at package4 s2)
   added: (in package4 truck3)
   goals met: 1 of 19
8. (load-truck package14 truck3 s2)
   deleted: (at package14 s2)
   added: (in package14 truck3)
   goals met: 1 of 19
9. (load-truck package13 truck3 s2)
   deleted: (at package13 s2)
   added: (in package13 truck3)
   goals met: 1 of 19
10. (drive-truck truck3 s2 s0 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 57 to 154
   goals met: 1 of 19
11. (load-truck package6 truck3 s0)
   deleted: (at package6 s0)
   added: (in package6 truck3)
   goals met: 1 of 19
12. (load-truck package8 truck3 s0)
   deleted: (at package8 s0)
   added: (in package8 truck3)
   goals met: 1 of 19
13. (load-truck package10 truck3 s0)
   deleted: (at package10 s0)
   added: (in package10 truck3)
   goals met: 1 of 19
14. (drive-truck truck3 s0 s1 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 154 to 185
   goals met: 1 of 19
15. (unload-truck package14 truck3 s1)
   deleted: (in package14 truck3)
   added: (at package14 s1)
   goals met: 2 of 19
16. (drive-truck truck3 s1 s3 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 185 to 230
   goals met: 2 of 19
17. (unload-truck package10 truck3 s3)
   deleted: (in package10 truck3)
   added: (at package10 s3)
   goals met: 3 of 19
18. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   changed: (walked) from 14 to 36
   goals met: 2 of 19
19. (drive-truck truck3 s3 s8 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s8)
   changed: (driven) from 230 to 253
   goals met: 2 of 19
20. (walk driver1 s0 p2-0)
   deleted: (at driver1 s0)
   added: (at driver1 p2-0)
   changed: (walked) from 36 to 41
   goals met: 2 of 19
21. (walk driver1 p2-0 s2)
   deleted: (at driver1 p2-0)
   added: (at driver1 s2)
   changed: (walked) from 41 to 50
   goals met: 2 of 19
22. (load-truck package5 truck3 s8)
   deleted: (at package5 s8)
   added: (in package5 truck3)
   goals met: 2 of 19
23. (unload-truck package6 truck3 s8)
   deleted: (in package6 truck3)
   added: (at package6 s8)
   goals met: 3 of 19
24. (load-truck package1 truck3 s8)
   deleted: (at package1 s8)
   added: (in package1 truck3)
   goals met: 3 of 19
25. (walk driver1 s2 p2-6)
   deleted: (at driver1 s2)
   added: (at driver1 p2-6)
   changed: (walked) from 50 to 87
   goals met: 3 of 19
26. (load-truck package7 truck3 s8)
   deleted: (at package7 s8)
   added: (in package7 truck3)
   goals met: 3 of 19
27. (walk driver3 p2-1 s2)
   deleted: (at driver3 p2-1)
   added: (at driver3 s2)
   changed: (walked) from 87 to 109
   goals met: 4 of 19
28. (drive-truck truck3 s8 s3 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s3)
   changed: (driven) from 253 to 276
   goals met: 4 of 19
29. (drive-truck truck3 s3 s7 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s7)
   changed: (driven) from 276 to 305
   goals met: 5 of 19
30. (unload-truck package5 truck3 s7)
   deleted: (in package5 truck3)
   added: (at package5 s7)
   goals met: 6 of 19
31. (load-truck package2 truck3 s7)
   deleted: (at package2 s7)
   added: (in package2 truck3)
   goals met: 6 of 19
32. (walk driver1 p2-6 s6)
   deleted: (at driver1 p2-6)
   added: (at driver1 s6)
   changed: (walked) from 109 to 177
   goals met: 7 of 19
33. (drive-truck truck3 s7 s4 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s4)
   changed: (driven) from 305 to 394
   goals met: 6 of 19
34. (unload-truck package7 truck3 s4)
   deleted: (in package7 truck3)
   added: (at package7 s4)
   goals met: 7 of 19
35. (drive-truck truck3 s4 s6 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   changed: (driven) from 394 to 474
   goals met: 7 of 19
36. (load-truck package3 truck3 s6)
   deleted: (at package3 s6)
   added: (in package3 truck3)
   goals met: 7 of 19
37. (drive-truck truck3 s6 s4 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (driven) from 474 to 554
   goals met: 7 of 19
38. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   changed: (walked) from 177 to 199
   goals met: 6 of 19
39. (drive-truck truck3 s4 s7 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s7)
   changed: (driven) from 554 to 643
   goals met: 7 of 19
40. (unload-truck package13 truck3 s7)
   deleted: (in package13 truck3)
   added: (at package13 s7)
   goals met: 8 of 19
41. (walk driver3 p2-1 s1)
   deleted: (at driver3 p2-1)
   added: (at driver3 s1)
   changed: (walked) from 199 to 257
   goals met: 8 of 19
42. (walk driver3 s1 p8-1)
   deleted: (at driver3 s1)
   added: (at driver3 p8-1)
   changed: (walked) from 257 to 284
   goals met: 8 of 19
43. (walk driver3 p8-1 s8)
   deleted: (at driver3 p8-1)
   added: (at driver3 s8)
   changed: (walked) from 284 to 341
   goals met: 8 of 19
44. (drive-truck truck3 s7 s0 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   changed: (driven) from 643 to 655
   goals met: 7 of 19
45. (unload-truck package4 truck3 s0)
   deleted: (in package4 truck3)
   added: (at package4 s0)
   goals met: 8 of 19
46. (board-truck driver3 truck4 s8)
   deleted: (at driver3 s8) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 8 of 19
47. (drive-truck truck4 s8 s2 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s2)
   changed: (driven) from 655 to 737
   goals met: 8 of 19
48. (disembark-truck driver3 truck4 s2)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 9 of 19
49. (unload-truck package1 truck3 s0)
   deleted: (in package1 truck3)
   added: (at package1 s0)
   goals met: 10 of 19
50. (drive-truck truck3 s0 s5 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (driven) from 737 to 802
   goals met: 10 of 19
51. (load-truck package9 truck3 s5)
   deleted: (at package9 s5)
   added: (in package9 truck3)
   goals met: 10 of 19
52. (load-truck package11 truck3 s5)
   deleted: (at package11 s5)
   added: (in package11 truck3)
   goals met: 10 of 19
53. (unload-truck package2 truck3 s5)
   deleted: (in package2 truck3)
   added: (at package2 s5)
   goals met: 11 of 19
54. (unload-truck package8 truck3 s5)
   deleted: (in package8 truck3)
   added: (at package8 s5)
   goals met: 12 of 19
55. (load-truck package12 truck3 s5)
   deleted: (at package12 s5)
   added: (in package12 truck3)
   goals met: 12 of 19
56. (drive-truck truck3 s5 s1 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (driven) from 802 to 806
   goals met: 12 of 19
57. (unload-truck package12 truck3 s1)
   deleted: (in package12 truck3)
   added: (at package12 s1)
   goals met: 13 of 19
58. (drive-truck truck3 s1 s3 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (driven) from 806 to 851
   goals met: 13 of 19
59. (unload-truck package11 truck3 s3)
   deleted: (in package11 truck3)
   added: (at package11 s3)
   goals met: 14 of 19
60. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 13 of 19
61. (drive-truck truck4 s2 s1 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (driven) from 851 to 905
   goals met: 13 of 19
62. (drive-truck truck3 s3 s8 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s8)
   changed: (driven) from 905 to 928
   goals met: 13 of 19
63. (unload-truck package3 truck3 s8)
   deleted: (in package3 truck3)
   added: (at package3 s8)
   goals met: 14 of 19
64. (drive-truck truck3 s8 s3 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s3)
   changed: (driven) from 928 to 951
   goals met: 14 of 19
65. (drive-truck truck3 s3 s4 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (driven) from 951 to 973
   goals met: 14 of 19
66. (unload-truck package9 truck3 s4)
   deleted: (in package9 truck3)
   added: (at package9 s4)
   goals met: 15 of 19
67. (drive-truck truck3 s4 s7 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s7)
   changed: (driven) from 973 to 1062
   goals met: 16 of 19
68. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 16 of 19
69. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 16 of 19
70. (drive-truck truck2 s1 s2 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 1062 to 1116
   goals met: 17 of 19
71. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 18 of 19
72. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   changed: (walked) from 341 to 363
   goals met: 17 of 19
73. (walk driver3 p2-1 s1)
   deleted: (at driver3 p2-1)
   added: (at driver3 s1)
   changed: (walked) from 363 to 421
   goals met: 17 of 19
74. (board-truck driver3 truck4 s1)
   deleted: (at driver3 s1) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 17 of 19
75. (drive-truck truck4 s1 s5 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   changed: (driven) from 1116 to 1120
   goals met: 18 of 19
76. (disembark-truck driver3 truck4 s5)
   deleted: (driving driver3 truck4)
   added: (at driver3 s5) (empty truck4)
   goals met: 18 of 19
77. (walk driver3 s5 p5-2)
   deleted: (at driver3 s5)
   added: (at driver3 p5-2)
   changed: (walked) from 421 to 515
   goals met: 18 of 19
78. (walk driver3 p5-2 s2)
   deleted: (at driver3 p5-2)
   added: (at driver3 s2)
   changed: (walked) from 515 to 544
   goals met: 19 of 19
